
[
    {
        "name": "The Ever Cake Website",
        "link": "https://dev.db61t1u90mry8.amplifyapp.com/",
        "id": 1,
        "info": 
            [
                {
                    "title": "Home page",
                    "image": "../src/images/the-ever-home.jpg",
                    "description": "Full stack web application built with React JS, Tailwind CSS, Redux Toolkit and Node JS. Integration with Stripe (payment gateway), and back-end processes are made using AWS services (Lambda functions, AWS SES, Dynamo DB)."
                },
                {
                    "title": "Online shop",
                    "image": "../src/images/online-shop.jpg",
                    "description": "The website has an online shop where the customers can check all the products available and select the preferred size, according to the prices and number of portions."
                },
                {
                    "title": "Shopping cart",
                    "image": "../src/images/shopping-cart.jpg",
                    "description": "All selected products are stored in the shopping cart. Here, the customers can review the number of items added with their price, and decide if they want to modify the order, clear the cart or proceed to checkout."
                },
                {
                    "title": "Checkout",
                    "image": "../src/images/checkout.jpg",
                    "description": "Customers can give a final review to their order with its final price. The application asks for their contact details and the delivery date of the products (min. 5 days). The payment is done via Stripe, and the customer will receive a notification at the top of the page once the transaction has been confirmed."
                },
                {
                    "title": "Email",
                    "image": "../src/images/email.jpg",
                    "description": "The business' owner and the customer will receive an email with the order summary and the tax invoice with an unique ID generated by the system once an order has been placed. The process is made with AWS Lambda, AWS SES and Node JS."
                },
                {
                    "title": "Dynamo DB",
                    "image": "../src/images/dynamo.jpg",
                    "description": "A Dynamo DB receives the orders' details (order ID, customer contact details, products selected, delivery date and total price). This database is what the business owner can use to check the orders history and filter the information by periods of time, flavours, etc."
                }
            ]
    },
    {
        "name": "2 Hands Services",
        "link": "https://2handsservices.com/",
        "id": 2,
        "info": 
            [
                {
                    "title": "Home page 2 hands",
                    "image": "../src/images/related-post-04.jpg",
                    "description": "Typescript-based React application using Vite."
                },
                {
                    "title": "Online shop",
                    "image": "../src/images/related-post-05.jpg",
                    "description": "This is the online shop page of 2 hands"
                },
                {
                    "title": "Shopping cart",
                    "image": "../src/images/shopping-cart.jpg",
                    "description": "This is the shopping cart page"
                },
                {
                    "title": "Checkout",
                    "image": "../src/images/checkout.jpg",
                    "description": "This is the checkout page"
                },
                {
                    "title": "Email",
                    "image": "../src/images/email.jpg",
                    "description": "This is the email"
                },
                {
                    "title": "Dynamo DB",
                    "image": "../src/images/dynamo.jpg",
                    "description": "This is the dynamo db"
                }
            ]
    }
]